<?php

$regions = [
    'Московская' => [
        'Москва',
        'Зеленоград',
        'Клин',
        'Наро-Фоминск'
    ],
    'Ленинградская' => [
        'Санкт-Петербург',
        'Всеволожск',
        'Павловск',
        'Кронштадт',
        'Гатчина'
    ],
    'Рязанская' => [
        'Рязань',
        'Касимов',
        'Кораблино',
        'Скопин'
    ],
    'Калужская' => [
        'Калуга',
        'Обнинск',
        'Киров',
        'Балабаново'
    ]
];

foreach ($regions as $my_key => $my_value){
    echo $my_key . ' область:<br>';
    foreach ($my_value as $city){
        if($city == end($my_value)){
            echo $city . '.<br>';
        } else {
            echo $city . ', ';
        }
    }
}